Revit.Elements.Room
Room Element

Revit.Elements.Room.InternalRevitElement
Internal reference to the Revit Element

Revit.Elements.Room.InternalElement
Reference to the Element

Revit.Elements.Room.#ctor(Autodesk.Revit.DB.Architecture.Room)
Create from existing element
Room:

Revit.Elements.Room.#ctor(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.XYZ,System.String,System.String)
Create a new Room by Level and location
level:
location:
name:
number:

Revit.Elements.Room.InitElement(Autodesk.Revit.DB.Architecture.Room)
Set internal element

Revit.Elements.Room.InternalSetElement(Autodesk.Revit.DB.Architecture.Room)
Set the internal Element, ElementId, and UniqueId

Revit.Elements.Room.ByLocation(Revit.Elements.Level,Autodesk.DesignScript.Geometry.Point,System.String,System.String)
Create a Revit Room Element
level: Level the room is hosted on
location: Location for the center of the room
name: Room name
number: Room number
Returns:

Revit.Elements.Room.Name
Get room name

Revit.Elements.Room.Number
Get room number

Revit.Elements.Room.Area
Get room area

Revit.Elements.Room.Height
Get room height

Revit.Elements.Room.Volume
Get room volume

Revit.Elements.Room.CenterBoundary
Centerline boundary

Revit.Elements.Room.CoreBoundary
Core boundary

Revit.Elements.Room.FinishBoundary
Finish boundary

Revit.Elements.Room.CoreCenterBoundary
Core center boundary

Revit.Elements.Room.Location
Get Room Location

Revit.Elements.Room.IsInsideRoom(Autodesk.DesignScript.Geometry.Point)
Check if a point is inside of a room

Revit.Elements.Room.SetName(System.String)
Set name
value: Name

Revit.Elements.Room.SetNumber(System.String)
Set number
value: Number